# Group Data
- **df.groupby()** => 해당 열로 Group 을 만든다
- **shift(1)* => 값들을 아래로 1행 만큼 shift, -1 이면 위로

In [2]:
import pandas as pd
import seaborn as sns

In [5]:
df = sns.load_dataset('mpg')
df.head(3) # 미리보기

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [7]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [8]:
df["origin"].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [9]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [10]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [17]:
df.groupby(by="origin")["cylinders"].mean() # 각각의 국가에서 생산하는 cylinder의 평균값을 알 수 있다

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [22]:
pd.DataFrame(df.groupby(['model_year','origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [48]:
df2 = pd.DataFrame(
[[4,7,10],
[5, 11,8],
[6,9,12]],
index = [1,2,3],
columns = ['a','b','c'])
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [49]:
df2.shift(1) # row 가 밑으로 1개씩 shift

     a     b     c
1  NaN   NaN   NaN
2  4.0   7.0  10.0
3  5.0  11.0   8.0

In [50]:
df2.shift(-1) # row 가 위로 1개씩 shift

     a     b     c
1  5.0  11.0   8.0
2  6.0   9.0  12.0
3  NaN   NaN   NaN

In [51]:
df2['b'].shift(2) # b 열만 아래로 shift 2

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

In [52]:
df['model_year'].rank(method='max') # 각각의 값이 몇번째 순위인지 보여준다

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [53]:
df['model_year'].rank(pct=True).head() # pct 는 비율을 의미한다

0    0.037688
1    0.037688
2    0.037688
3    0.037688
4    0.037688
Name: model_year, dtype: float64

In [54]:
df['model_year'].rank(method='first').head()  # 첫번째 값이 1위가 된다(순서)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [55]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [56]:
df2.cumsum() #아래 행으로 누적해서 더해준다

    a   b   c
1   4   7  10
2   9  18  18
3  15  27  30

In [60]:
df2.cummax() #각 행 까지의 열에서의 최대값을 구해준다

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  12

In [62]:
df2.cummin() #각 행 까지의 열에서의 최th값을 구해준다

   a  b   c
1  4  7  10
2  4  7   8
3  4  7   8

In [63]:
df2.cumprod() # 누적해서 값을 곱해준다

     a    b    c
1    4    7   10
2   20   77   80
3  120  693  960